/* Indexes.h
 *********************************************
 *                                           *
 *   Модуль индексов в векторах и матрицах   *
 *                                           *
 *             v1.0 (с) ITT, 2016            *
 *                                           *
 *********************************************
 * created: 15.05.2001 [Голиков В.П.]
 * revised: 22.12.2016 [Тенюшев Е.Н.]
 */

//-----------------------------------------------------------------------------
// Порядок углов - исторически сложившийся и соответствует порядку осей ПГИ в 
// ИНС-2000. К сожалению, он не соответствует ни порядку ГОСТовских осей ЛА 
// [крен, курс, тангаж]), ни порядку буржуйских осей [крен, тангаж, курс]
// (SiGMA-95, Totem-3000).
//-----------------------------------------------------------------------------

#pragma once

typedef enum IndexesType
{
    X = 0,    Y,     Z,             // [X, Y, Z]

    E = 0,    N,     U,             // [Восток, Север, Вертикаль]

    L = 0,    B,     H,             // [Долгота, широта, высота]
                     A = 2,         // [Долгота, широта, азимут]

    PITCH =0, ROLL,  HDG,           // [Тангаж, крен, курс]

    _1  = 0 , _2, _3, _4, _5, _6, _7, _8, _9,

    _11 = 0 ,_12, _13,              // Индексы матриц 3x3
    _21,     _22, _23,
    _31,     _32, _33
} Indexes;



//---------------------------------------------------------------------------
// Вычисление индекса массива размером Size c циклическим переносом
template <int Size>
int c_index(int Index)
{
    if(Index > Size) Index -= Size;
    else if (Index < 0) Index += Size;
    else {}                         // Ничего не делаем

    return Index;
}
